![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)

# <center> LESSON 5: Introduction to PANDAS </center>

## 1. INTRODUCTION

### 1.1 What is Pandas?

`Pandas = Panel Data`

### 1.2 Installation

- Cài đặt khi tạo môi trường ảo:
```
conda create -n hanh python=3.7 pandas
```
- Cài đặt sau khi tạo xong môi trường ảo:
```
conda install pandas
```
hoặc 
```
pip install pandas
```

### 1.3 Import

In [7]:
import pandas as pd

**Reference**: 
- [Pandas Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Python for Data Analysis](https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf)

## 2. BASICS

### 2.1 Objects in Pandas

- **DataFrame**: table, `pd.DataFrame()`
- **Series**: column, `pd.Series()`

![](https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png)
![](https://analyticssavvy.com/wp-content/uploads/2020/05/series-and-dataframe.png)

#### 2.1.1 How to create a DataFrame

1. Tạo ra 1 DataFrame rỗng

In [8]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

2. Tạo ra 1 DataFrame từ dict
- Một key có nhiều value
- các giá trị của các dict phải bằng nhau

In [12]:
dict1 = {'name':['Cuong','Hanh','Nghia'],
        'age':[10,20,40],
        'university':['MIT','VanLang', 'HoaSen']}
dict1 = pd.DataFrame(dict1, index = (f'student{i}' for i in range(1,4)))
dict1

           name  age university
student1  Cuong   10        MIT
student2   Hanh   20    VanLang
student3  Nghia   40     HoaSen

3. Tạo ra 1 DataFrame từ list của list

In [27]:
a = ['Cuong' , 10 , 'MIT']
b = ['Hanh' , 20 , 'VanLang']
c = ['Nghia' , 40 , 'HoaSen']
dict2 = pd.DataFrame([a,b,c], columns = ('name','age','university'), index = (f'student{i}' for i in range(1,4)) )
dict2

           name  age university
student1  Cuong   10        MIT
student2   Hanh   20    VanLang
student3  Nghia   40     HoaSen

4. Tạo ra 1 DataFrame từ zip

In [33]:
name = ['Cuong','Hanh','Nghia']
age = [10,20,40]
university = ['MIT','VanLang', 'HoaSen']
dict3 = pd.DataFrame(zip(name,age,university), 
                    columns = ('name','age','university'), 
                     index = (f'student{i}' for i in range(1,4)))
dict3

           name  age university
student1  Cuong   10        MIT
student2   Hanh   20    VanLang
student3  Nghia   40     HoaSen

5. Tạo từ 1 chuỗi numpy

In [39]:
import numpy as np
d = np.random.randint(1,13,(4,3), dtype=int)
d

array([[ 9,  7, 11],
       [12,  4,  5],
       [ 2,  7,  4],
       [ 8,  3,  7]])

In [40]:
pd.DataFrame(d)

    0  1   2
0   9  7  11
1  12  4   5
2   2  7   4
3   8  3   7

#### 2.1.2 How to create a Series
There are 2 way to create series
- Use pd.Series()
- Form Dtaframe

#### use pd.Series()

In [119]:
a = pd.Series({'name' : ['Cuong','Hanh','Nghia']})

#### use from DataFrame
- Cach 1: dict3.['column_name']
- Cach 2: dict3.{column_name}

In [45]:
dict3

           name  age university
student1  Cuong   10        MIT
student2   Hanh   20    VanLang
student3  Nghia   40     HoaSen

In [58]:
dict3['name'] # Can get many column, can get the column which the title have a space

student1    Cuong
student2     Hanh
student3    Nghia
Name: name, dtype: object

In [50]:
dict3.name

student1    Cuong
student2     Hanh
student3    Nghia
Name: name, dtype: object

### 2.2 I/O

Link: https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data

#### Load form local
cong thuc: pd.read_{kieu_file}(): pd.read_csv, pd.read_sql(), pd.read_excel()

In [70]:
f = pd.read_csv('Ecommerce Purchases') 
f.head(5) # get 5 row frist

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [66]:
f.tail(5) # get 5 row last

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
9995,"966 Castaneda Locks\nWest Juliafurt, CO 96415",92 XI,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...,Randall-Sloan,342945015358701,03/22,838,JCB 15 digit,iscott@wade-garner.com,Printmaker,29.73.197.114,it,82.21
9996,"832 Curtis Dam Suite 785\nNorth Edwardburgh, T...",41 JY,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Hale, Collins and Wilson",210033169205009,07/25,207,JCB 16 digit,mary85@hotmail.com,Energy engineer,121.133.168.51,pt,25.63
9997,Unit 4434 Box 6343\nDPO AE 28026-0283,74 Zh,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...,Anderson Ltd,6011539787356311,05/21,1,VISA 16 digit,tyler16@gmail.com,Veterinary surgeon,156.210.0.254,el,83.98
9998,"0096 English Rest\nRoystad, IA 12457",74 cL,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...,Cook Inc,180003348082930,11/17,987,American Express,elizabethmoore@reid.net,Local government officer,55.78.26.143,es,38.84
9999,"40674 Barrett Stravenue\nGrimesville, WI 79682",64 Hr,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...,Greene Inc,4139972901927273,02/19,302,JCB 15 digit,rachelford@vaughn.com,"Embryologist, clinical",176.119.198.199,el,67.59

##### Load form link
- cong thu: pd.read('link')
- Note: header = None => Dont use data as title

In [69]:
e = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data' , header = None) 
e.head(5)

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

#### Load from Seaborn library
- cong thu: sns.load_dataset('')
- link thu vien: https://github.com/mwaskom/seaborn-data

In [73]:
import seaborn as sns
r = sns.load_dataset('iris')
r.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### Save data 
Cong thuc: {ten bien}.to_{kieu file}('tenfile')

In [76]:
dict2.to_csv('cuong-save-test')

# Dataset Overview

## 1. Thông tin các cột
- Hàm {Tên_biến}.info()
- Kiểm tra data các cột có đủ ko, kiểu dữ liệu các cột, dung lượng file

In [78]:
dict1

           name  age university
student1  Cuong   10        MIT
student2   Hanh   20    VanLang
student3  Nghia   40     HoaSen

In [93]:
r.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [85]:
r.index # Kiểm tra số hàng trog bảng

RangeIndex(start=0, stop=150, step=1)

In [91]:
r.columns # Kiểm tra tên các dòng
list(r.columns) # Chuyển thành dạng list

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [94]:
r.describe() # Hàm kiểm cột có dữ liệu số

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 2.3 Indexing

Chọn tất cả các dòng (slicing):
- `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`

Chọn 1 cell:
- `at`:  `df.at[row_label,col_label]`
- `iat`: `df.iat[row_index,col_index]`

### Lọc Dataset Hàm location "Loc"
- Công thức: `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`

In [95]:
r.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [99]:
r.loc[(r.sepal_length == 5.1)] # Lấy những hàng mà giá trị tại cột speal_length = 5.1

    sepal_length  sepal_width  petal_length  petal_width     species
0            5.1          3.5           1.4          0.2      setosa
17           5.1          3.5           1.4          0.3      setosa
19           5.1          3.8           1.5          0.3      setosa
21           5.1          3.7           1.5          0.4      setosa
23           5.1          3.3           1.7          0.5      setosa
39           5.1          3.4           1.5          0.2      setosa
44           5.1          3.8           1.9          0.4      setosa
46           5.1          3.8           1.6          0.2      setosa
98           5.1          2.5           3.0          1.1  versicolor

In [102]:
# Lấy những hàng mà giá trị tại cột speal_length = 5.1 và Petal_length = 1.4
r.loc[(r.sepal_length == 5.1) & (r.petal_length ==1.4)]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa

In [103]:
# Lấy những hàng mà giá trị tại cột speal_length = 5.1 và Petal_length = 1.4  chỉ lấy 2 cột 'sepal_length','sepal_width'
r.loc[(r.sepal_length == 5.1) & (r.petal_length ==1.4),['sepal_length','sepal_width']]

    sepal_length  sepal_width
0            5.1          3.5
17           5.1          3.5

In [129]:
dict3.loc[('student1')] # lấy theo hàng trả về theo dạng Series

name          Cuong
age              10
university      MIT
Name: student1, dtype: object

### Index location iloc
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`
- df.iloc[bắt đầu cột : kết thúc cột ,Bắt đầu hàng :  kết thúc hàng]

Bài 1: Lấy hàng từ 1 đến 10

In [130]:
r.iloc[1:11]

    sepal_length  sepal_width  petal_length  petal_width species
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa

Bài 2: Lấy 3 cột đầu

In [147]:
m = r.iloc[:,:2].head(5)
m

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

# Data Manipulation
## kiểm tra cột dữ liệu kiểu gì: {tên biến}.{tên cột}.dtype

In [136]:
r.sepal_width.dtype

dtype('float64')

## Muốn làm vệt trên cột nào, ta dùng hàm apply()
- Cộng cột sepal_width thêm 1

In [144]:
r.sepal_width.apply( lambda x :  x + 1 )

0      4.5
1      4.0
2      4.2
3      4.1
4      4.6
      ...
145    4.0
146    3.5
147    4.0
148    4.4
149    4.0
Name: sepal_width, Length: 150, dtype: float64

## Tạo thêm column mới

In [148]:
m

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

In [155]:
m['total_sepal'] = m['sepal_length'] + m['sepal_width']

In [162]:
m.head(5)

   sepal_length  sepal_width  total_sepal
0           5.1          3.5          8.6
1           4.9          3.0          7.9
2           4.7          3.2          7.9
3           4.6          3.1          7.7
4           5.0          3.6          8.6

### Hàm Sum

In [159]:
m['total_sepal'].sum() # công tổng giá trị hàng total_sepal

40.699999999999996

In [167]:
m.sort_values('total_sepal' , ascending = False)

   sepal_length  sepal_width  total_sepal
0           5.1          3.5          8.6
4           5.0          3.6          8.6
1           4.9          3.0          7.9
2           4.7          3.2          7.9
3           4.6          3.1          7.7

### Group by

## unique

In [168]:
r

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [169]:
r.sepal_length.nunique() # Bao nhiêu giá trị unique trinbg

35

### 2.4 Masking

### 2.5 Operations

#### 2.5.1 Groupby

![](https://blog.dask.org/images/split-apply-combine.png)

#### 2.5.2 Pivot

#### 2.5.3 Others

|Merge methods| SQL Join Name | Meaning| _merge|
|-|-|-|-|
|left| LEFT OUTER JOIN|Chỉ sử dụng keys bên trái|left_only|
|right| RIGHT OUTER JOIN|Chỉ sử dụng keys bên phải|right_only|
|outer|FULL OUTER JOIN|Sử dụng keys của cả 2 dataframes|both|
|inner|INNER JOIN|Chỉ sử dụng keys giao nhau của 2 dataframes|both|

![](https://lh3.googleusercontent.com/-n76c6dtr5sw/YBO5d-3PzGI/AAAAAAAAAh8/xiT6YIzePLEXArb8uU1f1vgg8JRXYeg8ACLcBGAsYHQ/image.png)